11) src/Infrastructure/CurrencyConversor/CurrencyConversorExchangeRatesApi.php:32    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
     private function getLatestValues()
     {
         $response = $this->client->request('GET', sprintf(self::URL, $this->key));
-        print_r($response);
+        
     }
     /**
      * @throws AssertionFailedException

12) src/Infrastructure/CurrencyConversor/CurrencyConversorExchangeRatesApi.php:40    [M] Equal

--- Original
+++ New
@@ @@
      */
     public function convertPrice(ProductPrice $priceFrom, Currency $from, Currency $to) : ProductPrice
     {
-        if ('EUR' === $from->value() && 'USD' == $to->value()) {
+        if ('EUR' === $from->value() && 'USD' != $to->value()) {
             return ProductPrice::from($priceFrom->value() * $this->oneEurInUSD);
         }
         if ('USD' === $from->value() && 'EUR' == $to->value()) {

13) src/Infrastructure/CurrencyConversor/CurrencyConversorExchangeRatesApi.php:40    [M] LogicalAnd

--- Original
+++ New
@@ @@
      */
     public function convertPrice(ProductPrice $priceFrom, Currency $from, Currency $to) : ProductPrice
     {
-        if ('EUR' === $from->value() && 'USD' == $to->value()) {
+        if ('EUR' === $from->value() || 'USD' == $to->value()) {
             return ProductPrice::from($priceFrom->value() * $this->oneEurInUSD);
         }
         if ('USD' === $from->value() && 'EUR' == $to->value()) {

14) src/Infrastructure/CurrencyConversor/CurrencyConversorExchangeRatesApi.php:40    [M] Identical

--- Original
+++ New
@@ @@
      */
     public function convertPrice(ProductPrice $priceFrom, Currency $from, Currency $to) : ProductPrice
     {
-        if ('EUR' === $from->value() && 'USD' == $to->value()) {
+        if ('EUR' !== $from->value() && 'USD' == $to->value()) {
             return ProductPrice::from($priceFrom->value() * $this->oneEurInUSD);
         }
         if ('USD' === $from->value() && 'EUR' == $to->value()) {

15) src/Infrastructure/CurrencyConversor/CurrencyConversorExchangeRatesApi.php:41    [M] Multiplication

--- Original
+++ New
@@ @@
     public function convertPrice(ProductPrice $priceFrom, Currency $from, Currency $to) : ProductPrice
     {
         if ('EUR' === $from->value() && 'USD' == $to->value()) {
-            return ProductPrice::from($priceFrom->value() * $this->oneEurInUSD);
+            return ProductPrice::from($priceFrom->value() / $this->oneEurInUSD);
         }
         if ('USD' === $from->value() && 'EUR' == $to->value()) {
             return ProductPrice::from($priceFrom->value() / $this->oneEurInUSD);

16) src/Infrastructure/CurrencyConversor/CurrencyConversorExchangeRatesApi.php:44    [M] Identical

--- Original
+++ New
@@ @@
         if ('EUR' === $from->value() && 'USD' == $to->value()) {
             return ProductPrice::from($priceFrom->value() * $this->oneEurInUSD);
         }
-        if ('USD' === $from->value() && 'EUR' == $to->value()) {
+        if ('USD' !== $from->value() && 'EUR' == $to->value()) {
             return ProductPrice::from($priceFrom->value() / $this->oneEurInUSD);
         }
         return $priceFrom;
     }
 }

17) src/Infrastructure/CurrencyConversor/CurrencyConversorExchangeRatesApi.php:44    [M] Equal

--- Original
+++ New
@@ @@
         if ('EUR' === $from->value() && 'USD' == $to->value()) {
             return ProductPrice::from($priceFrom->value() * $this->oneEurInUSD);
         }
-        if ('USD' === $from->value() && 'EUR' == $to->value()) {
+        if ('USD' === $from->value() && 'EUR' != $to->value()) {
             return ProductPrice::from($priceFrom->value() / $this->oneEurInUSD);
         }
         return $priceFrom;
     }
 }

18) src/Infrastructure/CurrencyConversor/CurrencyConversorExchangeRatesApi.php:44    [M] LogicalAnd

--- Original
+++ New
@@ @@
         if ('EUR' === $from->value() && 'USD' == $to->value()) {
             return ProductPrice::from($priceFrom->value() * $this->oneEurInUSD);
         }
-        if ('USD' === $from->value() && 'EUR' == $to->value()) {
+        if ('USD' === $from->value() || 'EUR' == $to->value()) {
             return ProductPrice::from($priceFrom->value() / $this->oneEurInUSD);
         }
         return $priceFrom;
     }
 }

19) src/Infrastructure/CurrencyConversor/CurrencyConversorExchangeRatesApi.php:45    [M] Division

--- Original
+++ New
@@ @@
             return ProductPrice::from($priceFrom->value() * $this->oneEurInUSD);
         }
         if ('USD' === $from->value() && 'EUR' == $to->value()) {
-            return ProductPrice::from($priceFrom->value() / $this->oneEurInUSD);
+            return ProductPrice::from($priceFrom->value() * $this->oneEurInUSD);
         }
         return $priceFrom;
     }
 }

93) src/Infrastructure/Persistence/InMemory/InMemoryProductRepository.php:54    [M] Identical

--- Original
+++ New
@@ @@
         $results = $this->products;
         $criteria = Criteria::create()->setFirstResult(($numPage - 1) * $limit)->setMaxResults($limit);
         if (null !== $isFeatured) {
-            $results = $this->products->filter(static fn(Product $product) => $product->getFeatured() === $isFeatured);
+            $results = $this->products->filter(static fn(Product $product) => $product->getFeatured() !== $isFeatured);
         }
         return $results->matching($criteria)->toArray();
     }
