11) src/Infrastructure/CurrencyConversor/CurrencyConversorExchangeRatesApi.php:31    [M] CastFloat

--- Original
+++ New
@@ @@
         $this->key = $key;
         $this->cache = $redis;
         if ($value = $this->cache->get(self::KEY)) {
-            $this->oneEurInUSD = (float) $value;
+            $this->oneEurInUSD = $value;
             return;
         }
         $this->oneEurInUSD = $this->getLatestValues();

12) src/Infrastructure/CurrencyConversor/CurrencyConversorExchangeRatesApi.php:37    [M] IncrementInteger

--- Original
+++ New
@@ @@
             return;
         }
         $this->oneEurInUSD = $this->getLatestValues();
-        $this->cache->setex(self::KEY, 3600, $this->oneEurInUSD);
+        $this->cache->setex(self::KEY, 3601, $this->oneEurInUSD);
     }
     private function getLatestValues() : float
     {

13) src/Infrastructure/CurrencyConversor/CurrencyConversorExchangeRatesApi.php:37    [M] DecrementInteger

--- Original
+++ New
@@ @@
             return;
         }
         $this->oneEurInUSD = $this->getLatestValues();
-        $this->cache->setex(self::KEY, 3600, $this->oneEurInUSD);
+        $this->cache->setex(self::KEY, 3599, $this->oneEurInUSD);
     }
     private function getLatestValues() : float
     {

14) src/Infrastructure/CurrencyConversor/CurrencyConversorExchangeRatesApi.php:37    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             return;
         }
         $this->oneEurInUSD = $this->getLatestValues();
-        $this->cache->setex(self::KEY, 3600, $this->oneEurInUSD);
+        
     }
     private function getLatestValues() : float
     {

15) src/Infrastructure/CurrencyConversor/CurrencyConversorExchangeRatesApi.php:44    [M] CastFloat

--- Original
+++ New
@@ @@
     private function getLatestValues() : float
     {
         $data = json_decode(file_get_contents(sprintf(self::URL, $this->key)));
-        return (float) $data->rates->USD;
+        return $data->rates->USD;
     }
     /**
      * @throws AssertionFailedException
