1) src/Infrastructure/Behat/Context/ApplicationContext.php:46    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * @BeforeFeature
      * @AfterScenario @PurgeDatabase
      */
-    public static function purgeDatabase()
+    protected static function purgeDatabase()
     {
         $purger = new ORMPurger(self::$entityManager, self::EXCLUDED_TABLES);
         $purger->purge();

2) src/Infrastructure/Behat/Context/ApplicationContext.php:49    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public static function purgeDatabase()
     {
         $purger = new ORMPurger(self::$entityManager, self::EXCLUDED_TABLES);
-        $purger->purge();
+        
     }
     /**
      * @Given  /^A category that exists:$/

3) src/Infrastructure/Behat/Context/ApplicationContext.php:56    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * @Given  /^A category that exists:$/
      * @throws AssertionFailedException
      */
-    public function aCategoryThatExists(TableNode $table)
+    protected function aCategoryThatExists(TableNode $table)
     {
         foreach ($table->getHash() as $row) {
             $category = Category::create(CategoryId::from($row['id']), CategoryName::from($row['name']), CategoryDescription::from($row['description']));

4) src/Infrastructure/Behat/Context/ApplicationContext.php:58    [M] Foreach_

--- Original
+++ New
@@ @@
      */
     public function aCategoryThatExists(TableNode $table)
     {
-        foreach ($table->getHash() as $row) {
+        foreach (array() as $row) {
             $category = Category::create(CategoryId::from($row['id']), CategoryName::from($row['name']), CategoryDescription::from($row['description']));
             $this->categoryRepository->save($category);
         }

5) src/Infrastructure/Behat/Context/ApplicationContext.php:65    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         foreach ($table->getHash() as $row) {
             $category = Category::create(CategoryId::from($row['id']), CategoryName::from($row['name']), CategoryDescription::from($row['description']));
-            $this->categoryRepository->save($category);
+            
         }
     }
     /**

6) src/Infrastructure/Behat/Context/ApplicationContext.php:73    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * @Given /^A product that exists:$/
      * @throws AssertionFailedException
      */
-    public function aProductThatExists(TableNode $table)
+    protected function aProductThatExists(TableNode $table)
     {
         foreach ($table->getHash() as $row) {
             $category = Product::create(ProductId::from($row['id']), ProductName::from($row['name']), null, ProductPrice::from((float) $row['price']), Currency::from($row['currency']), (bool) $row['featured']);

8) src/Infrastructure/Behat/Context/ApplicationContext.php:80    [M] CastFloat

--- Original
+++ New
@@ @@
     public function aProductThatExists(TableNode $table)
     {
         foreach ($table->getHash() as $row) {
-            $category = Product::create(ProductId::from($row['id']), ProductName::from($row['name']), null, ProductPrice::from((float) $row['price']), Currency::from($row['currency']), (bool) $row['featured']);
+            $category = Product::create(ProductId::from($row['id']), ProductName::from($row['name']), null, ProductPrice::from($row['price']), Currency::from($row['currency']), (bool) $row['featured']);
             $this->productRepository->save($category);
         }
     }
 }

9) src/Infrastructure/Behat/Context/ApplicationContext.php:82    [M] CastBool

--- Original
+++ New
@@ @@
     public function aProductThatExists(TableNode $table)
     {
         foreach ($table->getHash() as $row) {
-            $category = Product::create(ProductId::from($row['id']), ProductName::from($row['name']), null, ProductPrice::from((float) $row['price']), Currency::from($row['currency']), (bool) $row['featured']);
+            $category = Product::create(ProductId::from($row['id']), ProductName::from($row['name']), null, ProductPrice::from((float) $row['price']), Currency::from($row['currency']), $row['featured']);
             $this->productRepository->save($category);
         }
     }
 }

10) src/Infrastructure/Behat/Context/ApplicationContext.php:85    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         foreach ($table->getHash() as $row) {
             $category = Product::create(ProductId::from($row['id']), ProductName::from($row['name']), null, ProductPrice::from((float) $row['price']), Currency::from($row['currency']), (bool) $row['featured']);
-            $this->productRepository->save($category);
+            
         }
     }
 }

11) src/Infrastructure/Delivery/Rest/Category/CreateCategoryPage.php:22    [M] FalseValue

--- Original
+++ New
@@ @@
      */
     public function __invoke(Request $request) : JsonResponse
     {
-        $payload = json_decode($request->getContent(), false);
+        $payload = json_decode($request->getContent(), true);
         $id = $payload->id ?? Uuid::uuid4()->toString();
         $this->dispatch(new CreateCategoryCommand($id, $payload->name ?? '', $payload->description ?? ''));
         return new JsonResponse(['id' => $id], Response::HTTP_OK);
     }
 }

12) src/Infrastructure/Delivery/Rest/Category/CreateCategoryPage.php:24    [M] Coalesce

--- Original
+++ New
@@ @@
     public function __invoke(Request $request) : JsonResponse
     {
         $payload = json_decode($request->getContent(), false);
-        $id = $payload->id ?? Uuid::uuid4()->toString();
+        $id = Uuid::uuid4()->toString();
         $this->dispatch(new CreateCategoryCommand($id, $payload->name ?? '', $payload->description ?? ''));
         return new JsonResponse(['id' => $id], Response::HTTP_OK);
     }
 }

13) src/Infrastructure/Delivery/Rest/Category/CreateCategoryPage.php:26    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $payload = json_decode($request->getContent(), false);
         $id = $payload->id ?? Uuid::uuid4()->toString();
-        $this->dispatch(new CreateCategoryCommand($id, $payload->name ?? '', $payload->description ?? ''));
+        
         return new JsonResponse(['id' => $id], Response::HTTP_OK);
     }
 }

14) src/Infrastructure/Delivery/Rest/Category/CreateCategoryPage.php:29    [M] Coalesce

--- Original
+++ New
@@ @@
     {
         $payload = json_decode($request->getContent(), false);
         $id = $payload->id ?? Uuid::uuid4()->toString();
-        $this->dispatch(new CreateCategoryCommand($id, $payload->name ?? '', $payload->description ?? ''));
+        $this->dispatch(new CreateCategoryCommand($id, '', $payload->description ?? ''));
         return new JsonResponse(['id' => $id], Response::HTTP_OK);
     }
 }

15) src/Infrastructure/Delivery/Rest/Category/CreateCategoryPage.php:30    [M] Coalesce

--- Original
+++ New
@@ @@
     {
         $payload = json_decode($request->getContent(), false);
         $id = $payload->id ?? Uuid::uuid4()->toString();
-        $this->dispatch(new CreateCategoryCommand($id, $payload->name ?? '', $payload->description ?? ''));
+        $this->dispatch(new CreateCategoryCommand($id, $payload->name ?? '', ''));
         return new JsonResponse(['id' => $id], Response::HTTP_OK);
     }
 }

16) src/Infrastructure/Delivery/Rest/Category/CreateCategoryPage.php:34    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $payload = json_decode($request->getContent(), false);
         $id = $payload->id ?? Uuid::uuid4()->toString();
         $this->dispatch(new CreateCategoryCommand($id, $payload->name ?? '', $payload->description ?? ''));
-        return new JsonResponse(['id' => $id], Response::HTTP_OK);
+        return new JsonResponse([], Response::HTTP_OK);
     }
 }

18) src/Infrastructure/Delivery/Rest/Category/UpdateCategoryPage.php:26    [M] Coalesce

--- Original
+++ New
@@ @@
     public function __invoke(string $id, Request $request) : JsonResponse
     {
         $payload = json_decode($request->getContent(), false);
-        $result = $this->dispatch(new UpdateCategoryCommand($id, $payload->name ?? '', $payload->descriptin ?? ''));
+        $result = $this->dispatch(new UpdateCategoryCommand($id, '', $payload->descriptin ?? ''));
         return new JsonResponse($result, Response::HTTP_OK);
     }
 }

19) src/Infrastructure/Delivery/Rest/Category/UpdateCategoryPage.php:27    [M] Coalesce

--- Original
+++ New
@@ @@
     public function __invoke(string $id, Request $request) : JsonResponse
     {
         $payload = json_decode($request->getContent(), false);
-        $result = $this->dispatch(new UpdateCategoryCommand($id, $payload->name ?? '', $payload->descriptin ?? ''));
+        $result = $this->dispatch(new UpdateCategoryCommand($id, $payload->name ?? '', ''));
         return new JsonResponse($result, Response::HTTP_OK);
     }
 }

22) src/Infrastructure/Delivery/Rest/Product/CreateProductPage.php:26    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $payload = json_decode($request->getContent(), false);
         $id = $payload->id ?? Uuid::uuid4()->toString();
-        $this->dispatch(new CreateProductCommand($id, $payload->name ?? '', $payload->categoryId ?? null, $payload->price ?? 0, $payload->currency ?? '', $payload->featured ?? false));
+        
         return new JsonResponse(['id' => $id], Response::HTTP_OK);
     }
 }

23) src/Infrastructure/Delivery/Rest/Product/CreateProductPage.php:29    [M] Coalesce

--- Original
+++ New
@@ @@
     {
         $payload = json_decode($request->getContent(), false);
         $id = $payload->id ?? Uuid::uuid4()->toString();
-        $this->dispatch(new CreateProductCommand($id, $payload->name ?? '', $payload->categoryId ?? null, $payload->price ?? 0, $payload->currency ?? '', $payload->featured ?? false));
+        $this->dispatch(new CreateProductCommand($id, '', $payload->categoryId ?? null, $payload->price ?? 0, $payload->currency ?? '', $payload->featured ?? false));
         return new JsonResponse(['id' => $id], Response::HTTP_OK);
     }
 }

24) src/Infrastructure/Delivery/Rest/Product/CreateProductPage.php:30    [M] Coalesce

--- Original
+++ New
@@ @@
     {
         $payload = json_decode($request->getContent(), false);
         $id = $payload->id ?? Uuid::uuid4()->toString();
-        $this->dispatch(new CreateProductCommand($id, $payload->name ?? '', $payload->categoryId ?? null, $payload->price ?? 0, $payload->currency ?? '', $payload->featured ?? false));
+        $this->dispatch(new CreateProductCommand($id, $payload->name ?? '', null, $payload->price ?? 0, $payload->currency ?? '', $payload->featured ?? false));
         return new JsonResponse(['id' => $id], Response::HTTP_OK);
     }
 }

25) src/Infrastructure/Delivery/Rest/Product/CreateProductPage.php:31    [M] DecrementInteger

--- Original
+++ New
@@ @@
     {
         $payload = json_decode($request->getContent(), false);
         $id = $payload->id ?? Uuid::uuid4()->toString();
-        $this->dispatch(new CreateProductCommand($id, $payload->name ?? '', $payload->categoryId ?? null, $payload->price ?? 0, $payload->currency ?? '', $payload->featured ?? false));
+        $this->dispatch(new CreateProductCommand($id, $payload->name ?? '', $payload->categoryId ?? null, $payload->price ?? -1, $payload->currency ?? '', $payload->featured ?? false));
         return new JsonResponse(['id' => $id], Response::HTTP_OK);
     }
 }

26) src/Infrastructure/Delivery/Rest/Product/CreateProductPage.php:31    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     {
         $payload = json_decode($request->getContent(), false);
         $id = $payload->id ?? Uuid::uuid4()->toString();
-        $this->dispatch(new CreateProductCommand($id, $payload->name ?? '', $payload->categoryId ?? null, $payload->price ?? 0, $payload->currency ?? '', $payload->featured ?? false));
+        $this->dispatch(new CreateProductCommand($id, $payload->name ?? '', $payload->categoryId ?? null, $payload->price ?? 1, $payload->currency ?? '', $payload->featured ?? false));
         return new JsonResponse(['id' => $id], Response::HTTP_OK);
     }
 }

27) src/Infrastructure/Delivery/Rest/Product/CreateProductPage.php:31    [M] Coalesce

--- Original
+++ New
@@ @@
     {
         $payload = json_decode($request->getContent(), false);
         $id = $payload->id ?? Uuid::uuid4()->toString();
-        $this->dispatch(new CreateProductCommand($id, $payload->name ?? '', $payload->categoryId ?? null, $payload->price ?? 0, $payload->currency ?? '', $payload->featured ?? false));
+        $this->dispatch(new CreateProductCommand($id, $payload->name ?? '', $payload->categoryId ?? null, 0, $payload->currency ?? '', $payload->featured ?? false));
         return new JsonResponse(['id' => $id], Response::HTTP_OK);
     }
 }

28) src/Infrastructure/Delivery/Rest/Product/CreateProductPage.php:32    [M] Coalesce

--- Original
+++ New
@@ @@
     {
         $payload = json_decode($request->getContent(), false);
         $id = $payload->id ?? Uuid::uuid4()->toString();
-        $this->dispatch(new CreateProductCommand($id, $payload->name ?? '', $payload->categoryId ?? null, $payload->price ?? 0, $payload->currency ?? '', $payload->featured ?? false));
+        $this->dispatch(new CreateProductCommand($id, $payload->name ?? '', $payload->categoryId ?? null, $payload->price ?? 0, '', $payload->featured ?? false));
         return new JsonResponse(['id' => $id], Response::HTTP_OK);
     }
 }

29) src/Infrastructure/Delivery/Rest/Product/CreateProductPage.php:33    [M] FalseValue

--- Original
+++ New
@@ @@
     {
         $payload = json_decode($request->getContent(), false);
         $id = $payload->id ?? Uuid::uuid4()->toString();
-        $this->dispatch(new CreateProductCommand($id, $payload->name ?? '', $payload->categoryId ?? null, $payload->price ?? 0, $payload->currency ?? '', $payload->featured ?? false));
+        $this->dispatch(new CreateProductCommand($id, $payload->name ?? '', $payload->categoryId ?? null, $payload->price ?? 0, $payload->currency ?? '', $payload->featured ?? true));
         return new JsonResponse(['id' => $id], Response::HTTP_OK);
     }
 }

30) src/Infrastructure/Delivery/Rest/Product/CreateProductPage.php:33    [M] Coalesce

--- Original
+++ New
@@ @@
     {
         $payload = json_decode($request->getContent(), false);
         $id = $payload->id ?? Uuid::uuid4()->toString();
-        $this->dispatch(new CreateProductCommand($id, $payload->name ?? '', $payload->categoryId ?? null, $payload->price ?? 0, $payload->currency ?? '', $payload->featured ?? false));
+        $this->dispatch(new CreateProductCommand($id, $payload->name ?? '', $payload->categoryId ?? null, $payload->price ?? 0, $payload->currency ?? '', false));
         return new JsonResponse(['id' => $id], Response::HTTP_OK);
     }
 }

31) src/Infrastructure/Delivery/Rest/Product/CreateProductPage.php:37    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $payload = json_decode($request->getContent(), false);
         $id = $payload->id ?? Uuid::uuid4()->toString();
         $this->dispatch(new CreateProductCommand($id, $payload->name ?? '', $payload->categoryId ?? null, $payload->price ?? 0, $payload->currency ?? '', $payload->featured ?? false));
-        return new JsonResponse(['id' => $id], Response::HTTP_OK);
+        return new JsonResponse([], Response::HTTP_OK);
     }
 }

32) src/Infrastructure/Persistence/Doctrine/Repository/DoctrineCategoryRepository.php:29    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function save(Category $category) : void
     {
-        $this->entityManager->persist($category);
+        
         $this->entityManager->flush();
     }
     public function delete(Category $category) : void

33) src/Infrastructure/Persistence/Doctrine/Repository/DoctrineCategoryRepository.php:30    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function save(Category $category) : void
     {
         $this->entityManager->persist($category);
-        $this->entityManager->flush();
+        
     }
     public function delete(Category $category) : void
     {

34) src/Infrastructure/Persistence/Doctrine/Repository/DoctrineCategoryRepository.php:35    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function delete(Category $category) : void
     {
-        $this->entityManager->remove($category);
+        
         $this->entityManager->flush();
     }
     /** @throws DomainException */

35) src/Infrastructure/Persistence/Doctrine/Repository/DoctrineCategoryRepository.php:36    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function delete(Category $category) : void
     {
         $this->entityManager->remove($category);
-        $this->entityManager->flush();
+        
     }
     /** @throws DomainException */
     public function ofIdOrFail(CategoryId $categoryId) : Category

36) src/Infrastructure/Persistence/Doctrine/Repository/DoctrineCategoryRepository.php:44    [M] InstanceOf_

--- Original
+++ New
@@ @@
     public function ofIdOrFail(CategoryId $categoryId) : Category
     {
         $category = $this->repository->find($categoryId->value());
-        if (!$category instanceof Category) {
+        if (!false) {
             throw CategoryNotFoundException::create($categoryId->value());
         }
         return $category;

37) src/Infrastructure/Persistence/Doctrine/Repository/DoctrineCategoryRepository.php:44    [M] InstanceOf_

--- Original
+++ New
@@ @@
     public function ofIdOrFail(CategoryId $categoryId) : Category
     {
         $category = $this->repository->find($categoryId->value());
-        if (!$category instanceof Category) {
+        if (!true) {
             throw CategoryNotFoundException::create($categoryId->value());
         }
         return $category;

38) src/Infrastructure/Persistence/Doctrine/Repository/DoctrineCategoryRepository.php:44    [M] LogicalNot

--- Original
+++ New
@@ @@
     public function ofIdOrFail(CategoryId $categoryId) : Category
     {
         $category = $this->repository->find($categoryId->value());
-        if (!$category instanceof Category) {
+        if ($category instanceof Category) {
             throw CategoryNotFoundException::create($categoryId->value());
         }
         return $category;

39) src/Infrastructure/Persistence/Doctrine/Repository/DoctrineCategoryRepository.php:45    [M] Throw_

--- Original
+++ New
@@ @@
     {
         $category = $this->repository->find($categoryId->value());
         if (!$category instanceof Category) {
-            throw CategoryNotFoundException::create($categoryId->value());
+            CategoryNotFoundException::create($categoryId->value());
         }
         return $category;
     }

40) src/Infrastructure/Persistence/Doctrine/Repository/DoctrineProductRepository.php:33    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function save(Product $product) : void
     {
-        $this->entityManager->persist($product);
+        
         $this->entityManager->flush();
     }
     /** @throws QueryException

41) src/Infrastructure/Persistence/Doctrine/Repository/DoctrineProductRepository.php:34    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function save(Product $product) : void
     {
         $this->entityManager->persist($product);
-        $this->entityManager->flush();
+        
     }
     /** @throws QueryException
      * @throws AssertionFailedException

42) src/Infrastructure/Persistence/Doctrine/Repository/DoctrineProductRepository.php:40    [M] DecrementInteger

--- Original
+++ New
@@ @@
     /** @throws QueryException
      * @throws AssertionFailedException
      */
-    public function search(?bool $isFeatured, int $numPage = 0, int $limit = 0) : array
+    public function search(?bool $isFeatured, int $numPage = -1, int $limit = 0) : array
     {
         Assertion::greaterOrEqualThan($numPage, 1, 'Page must be greater or equal than 1');
         Assertion::greaterOrEqualThan($limit, 1, 'Limit must be greater or equal than 1');

43) src/Infrastructure/Persistence/Doctrine/Repository/DoctrineProductRepository.php:40    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     /** @throws QueryException
      * @throws AssertionFailedException
      */
-    public function search(?bool $isFeatured, int $numPage = 0, int $limit = 0) : array
+    public function search(?bool $isFeatured, int $numPage = 0, int $limit = 1) : array
     {
         Assertion::greaterOrEqualThan($numPage, 1, 'Page must be greater or equal than 1');
         Assertion::greaterOrEqualThan($limit, 1, 'Limit must be greater or equal than 1');

44) src/Infrastructure/Persistence/Doctrine/Repository/DoctrineProductRepository.php:40    [M] DecrementInteger

--- Original
+++ New
@@ @@
     /** @throws QueryException
      * @throws AssertionFailedException
      */
-    public function search(?bool $isFeatured, int $numPage = 0, int $limit = 0) : array
+    public function search(?bool $isFeatured, int $numPage = 0, int $limit = -1) : array
     {
         Assertion::greaterOrEqualThan($numPage, 1, 'Page must be greater or equal than 1');
         Assertion::greaterOrEqualThan($limit, 1, 'Limit must be greater or equal than 1');

45) src/Infrastructure/Persistence/Doctrine/Repository/DoctrineProductRepository.php:40    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     /** @throws QueryException
      * @throws AssertionFailedException
      */
-    public function search(?bool $isFeatured, int $numPage = 0, int $limit = 0) : array
+    public function search(?bool $isFeatured, int $numPage = 1, int $limit = 0) : array
     {
         Assertion::greaterOrEqualThan($numPage, 1, 'Page must be greater or equal than 1');
         Assertion::greaterOrEqualThan($limit, 1, 'Limit must be greater or equal than 1');

46) src/Infrastructure/Persistence/Doctrine/Repository/DoctrineProductRepository.php:42    [M] OneZeroInteger

--- Original
+++ New
@@ @@
      */
     public function search(?bool $isFeatured, int $numPage = 0, int $limit = 0) : array
     {
-        Assertion::greaterOrEqualThan($numPage, 1, 'Page must be greater or equal than 1');
+        Assertion::greaterOrEqualThan($numPage, 0, 'Page must be greater or equal than 1');
         Assertion::greaterOrEqualThan($limit, 1, 'Limit must be greater or equal than 1');
         $criteria = Criteria::create()->setFirstResult(($numPage - 1) * $limit)->setMaxResults($limit);
         if (null !== $isFeatured) {

47) src/Infrastructure/Persistence/Doctrine/Repository/DoctrineProductRepository.php:42    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function search(?bool $isFeatured, int $numPage = 0, int $limit = 0) : array
     {
-        Assertion::greaterOrEqualThan($numPage, 1, 'Page must be greater or equal than 1');
+        
         Assertion::greaterOrEqualThan($limit, 1, 'Limit must be greater or equal than 1');
         $criteria = Criteria::create()->setFirstResult(($numPage - 1) * $limit)->setMaxResults($limit);
         if (null !== $isFeatured) {

48) src/Infrastructure/Persistence/Doctrine/Repository/DoctrineProductRepository.php:42    [M] IncrementInteger

--- Original
+++ New
@@ @@
      */
     public function search(?bool $isFeatured, int $numPage = 0, int $limit = 0) : array
     {
-        Assertion::greaterOrEqualThan($numPage, 1, 'Page must be greater or equal than 1');
+        Assertion::greaterOrEqualThan($numPage, 2, 'Page must be greater or equal than 1');
         Assertion::greaterOrEqualThan($limit, 1, 'Limit must be greater or equal than 1');
         $criteria = Criteria::create()->setFirstResult(($numPage - 1) * $limit)->setMaxResults($limit);
         if (null !== $isFeatured) {

49) src/Infrastructure/Persistence/Doctrine/Repository/DoctrineProductRepository.php:43    [M] IncrementInteger

--- Original
+++ New
@@ @@
     public function search(?bool $isFeatured, int $numPage = 0, int $limit = 0) : array
     {
         Assertion::greaterOrEqualThan($numPage, 1, 'Page must be greater or equal than 1');
-        Assertion::greaterOrEqualThan($limit, 1, 'Limit must be greater or equal than 1');
+        Assertion::greaterOrEqualThan($limit, 2, 'Limit must be greater or equal than 1');
         $criteria = Criteria::create()->setFirstResult(($numPage - 1) * $limit)->setMaxResults($limit);
         if (null !== $isFeatured) {
             $criteria->where(Criteria::expr()->eq('featured', $isFeatured));

50) src/Infrastructure/Persistence/Doctrine/Repository/DoctrineProductRepository.php:43    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     public function search(?bool $isFeatured, int $numPage = 0, int $limit = 0) : array
     {
         Assertion::greaterOrEqualThan($numPage, 1, 'Page must be greater or equal than 1');
-        Assertion::greaterOrEqualThan($limit, 1, 'Limit must be greater or equal than 1');
+        Assertion::greaterOrEqualThan($limit, 0, 'Limit must be greater or equal than 1');
         $criteria = Criteria::create()->setFirstResult(($numPage - 1) * $limit)->setMaxResults($limit);
         if (null !== $isFeatured) {
             $criteria->where(Criteria::expr()->eq('featured', $isFeatured));

51) src/Infrastructure/Persistence/Doctrine/Repository/DoctrineProductRepository.php:43    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function search(?bool $isFeatured, int $numPage = 0, int $limit = 0) : array
     {
         Assertion::greaterOrEqualThan($numPage, 1, 'Page must be greater or equal than 1');
-        Assertion::greaterOrEqualThan($limit, 1, 'Limit must be greater or equal than 1');
+        
         $criteria = Criteria::create()->setFirstResult(($numPage - 1) * $limit)->setMaxResults($limit);
         if (null !== $isFeatured) {
             $criteria->where(Criteria::expr()->eq('featured', $isFeatured));

52) src/Infrastructure/Persistence/Doctrine/Repository/DoctrineProductRepository.php:45    [M] Multiplication

--- Original
+++ New
@@ @@
     {
         Assertion::greaterOrEqualThan($numPage, 1, 'Page must be greater or equal than 1');
         Assertion::greaterOrEqualThan($limit, 1, 'Limit must be greater or equal than 1');
-        $criteria = Criteria::create()->setFirstResult(($numPage - 1) * $limit)->setMaxResults($limit);
+        $criteria = Criteria::create()->setFirstResult(($numPage - 1) / $limit)->setMaxResults($limit);
         if (null !== $isFeatured) {
             $criteria->where(Criteria::expr()->eq('featured', $isFeatured));
         }

53) src/Infrastructure/Persistence/Doctrine/Repository/DoctrineProductRepository.php:45    [M] Minus

--- Original
+++ New
@@ @@
     {
         Assertion::greaterOrEqualThan($numPage, 1, 'Page must be greater or equal than 1');
         Assertion::greaterOrEqualThan($limit, 1, 'Limit must be greater or equal than 1');
-        $criteria = Criteria::create()->setFirstResult(($numPage - 1) * $limit)->setMaxResults($limit);
+        $criteria = Criteria::create()->setFirstResult(($numPage + 1) * $limit)->setMaxResults($limit);
         if (null !== $isFeatured) {
             $criteria->where(Criteria::expr()->eq('featured', $isFeatured));
         }

54) src/Infrastructure/Persistence/Doctrine/Repository/DoctrineProductRepository.php:45    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     {
         Assertion::greaterOrEqualThan($numPage, 1, 'Page must be greater or equal than 1');
         Assertion::greaterOrEqualThan($limit, 1, 'Limit must be greater or equal than 1');
-        $criteria = Criteria::create()->setFirstResult(($numPage - 1) * $limit)->setMaxResults($limit);
+        $criteria = Criteria::create()->setFirstResult(($numPage - 0) * $limit)->setMaxResults($limit);
         if (null !== $isFeatured) {
             $criteria->where(Criteria::expr()->eq('featured', $isFeatured));
         }

55) src/Infrastructure/Persistence/Doctrine/Repository/DoctrineProductRepository.php:45    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
         Assertion::greaterOrEqualThan($numPage, 1, 'Page must be greater or equal than 1');
         Assertion::greaterOrEqualThan($limit, 1, 'Limit must be greater or equal than 1');
-        $criteria = Criteria::create()->setFirstResult(($numPage - 1) * $limit)->setMaxResults($limit);
+        $criteria = Criteria::create()->setFirstResult(($numPage - 2) * $limit)->setMaxResults($limit);
         if (null !== $isFeatured) {
             $criteria->where(Criteria::expr()->eq('featured', $isFeatured));
         }

56) src/Infrastructure/Persistence/Doctrine/Repository/DoctrineProductRepository.php:47    [M] NotIdentical

--- Original
+++ New
@@ @@
         Assertion::greaterOrEqualThan($numPage, 1, 'Page must be greater or equal than 1');
         Assertion::greaterOrEqualThan($limit, 1, 'Limit must be greater or equal than 1');
         $criteria = Criteria::create()->setFirstResult(($numPage - 1) * $limit)->setMaxResults($limit);
-        if (null !== $isFeatured) {
+        if (null === $isFeatured) {
             $criteria->where(Criteria::expr()->eq('featured', $isFeatured));
         }
         return $this->entityManager->createQueryBuilder()->select('c')->from(Product::class, 'c')->addCriteria($criteria)->getQuery()->getResult();

57) src/Infrastructure/Persistence/Doctrine/Repository/DoctrineProductRepository.php:48    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         Assertion::greaterOrEqualThan($limit, 1, 'Limit must be greater or equal than 1');
         $criteria = Criteria::create()->setFirstResult(($numPage - 1) * $limit)->setMaxResults($limit);
         if (null !== $isFeatured) {
-            $criteria->where(Criteria::expr()->eq('featured', $isFeatured));
+            
         }
         return $this->entityManager->createQueryBuilder()->select('c')->from(Product::class, 'c')->addCriteria($criteria)->getQuery()->getResult();
     }
