58) src/Infrastructure/Persistence/Doctrine/Repository/DoctrineProductRepository.php:68    [M] NotIdentical

--- Original
+++ New
@@ @@
     public function searchCount(?bool $isFeatured) : int
     {
         $criteria = Criteria::create();
-        if (null !== $isFeatured) {
+        if (null === $isFeatured) {
             $criteria->where(Criteria::expr()->eq('featured', $isFeatured));
         }
         return (int) $this->entityManager->createQueryBuilder()->select('count(c.id)')->from(Product::class, 'c')->addCriteria($criteria)->getQuery()->getSingleScalarResult();

60) src/Infrastructure/Persistence/Doctrine/Repository/DoctrineProductRepository.php:72    [M] CastInt

--- Original
+++ New
@@ @@
         if (null !== $isFeatured) {
             $criteria->where(Criteria::expr()->eq('featured', $isFeatured));
         }
-        return (int) $this->entityManager->createQueryBuilder()->select('count(c.id)')->from(Product::class, 'c')->addCriteria($criteria)->getQuery()->getSingleScalarResult();
+        return $this->entityManager->createQueryBuilder()->select('count(c.id)')->from(Product::class, 'c')->addCriteria($criteria)->getQuery()->getSingleScalarResult();
     }
     public function ofId(ProductId $productId) : ?Product
     {

61) src/Infrastructure/Persistence/InMemory/InMemoryCategoryRepository.php:26    [M] Foreach_

--- Original
+++ New
@@ @@
     public function __construct(array $categories = [])
     {
         $this->categories = new ArrayCollection([]);
-        foreach ($categories as $analyticalTest) {
+        foreach (array() as $analyticalTest) {
             $this->save($analyticalTest);
         }
     }

62) src/Infrastructure/Persistence/InMemory/InMemoryCategoryRepository.php:27    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $this->categories = new ArrayCollection([]);
         foreach ($categories as $analyticalTest) {
-            $this->save($analyticalTest);
+            
         }
     }
     public function save(Category $category) : void

63) src/Infrastructure/Persistence/InMemory/InMemoryCategoryRepository.php:34    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function save(Category $category) : void
     {
         $id = $category->getId()->value();
-        $this->categories->set($id, $category);
+        
     }
     public function delete(Category $category) : void
     {

64) src/Infrastructure/Persistence/InMemory/InMemoryCategoryRepository.php:39    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function delete(Category $category) : void
     {
-        $this->categories->remove($category->getId()->value());
+        
     }
     /**
      * @throws DomainException

65) src/Infrastructure/Persistence/InMemory/InMemoryCategoryRepository.php:49    [M] LogicalNot

--- Original
+++ New
@@ @@
     public function ofIdOrFail(CategoryId $categoryId) : Category
     {
         $category = $this->categories->get($categoryId->value());
-        if (!$category instanceof Category) {
+        if ($category instanceof Category) {
             throw CategoryNotFoundException::create($categoryId->value());
         }
         return clone $category;

66) src/Infrastructure/Persistence/InMemory/InMemoryCategoryRepository.php:49    [M] InstanceOf_

--- Original
+++ New
@@ @@
     public function ofIdOrFail(CategoryId $categoryId) : Category
     {
         $category = $this->categories->get($categoryId->value());
-        if (!$category instanceof Category) {
+        if (!false) {
             throw CategoryNotFoundException::create($categoryId->value());
         }
         return clone $category;

67) src/Infrastructure/Persistence/InMemory/InMemoryCategoryRepository.php:49    [M] InstanceOf_

--- Original
+++ New
@@ @@
     public function ofIdOrFail(CategoryId $categoryId) : Category
     {
         $category = $this->categories->get($categoryId->value());
-        if (!$category instanceof Category) {
+        if (!true) {
             throw CategoryNotFoundException::create($categoryId->value());
         }
         return clone $category;

69) src/Infrastructure/Persistence/InMemory/InMemoryCategoryRepository.php:53    [M] CloneRemoval

--- Original
+++ New
@@ @@
         if (!$category instanceof Category) {
             throw CategoryNotFoundException::create($categoryId->value());
         }
-        return clone $category;
+        return $category;
     }
     public function ofId(CategoryId $categoryId) : ?Category
     {

70) src/Infrastructure/Persistence/InMemory/InMemoryProductRepository.php:28    [M] Foreach_

--- Original
+++ New
@@ @@
     public function __construct(array $products = [])
     {
         $this->products = new ArrayCollection([]);
-        foreach ($products as $product) {
+        foreach (array() as $product) {
             $this->save($product);
         }
     }

71) src/Infrastructure/Persistence/InMemory/InMemoryProductRepository.php:29    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $this->products = new ArrayCollection([]);
         foreach ($products as $product) {
-            $this->save($product);
+            
         }
     }
     public function save(Product $product) : void

72) src/Infrastructure/Persistence/InMemory/InMemoryProductRepository.php:35    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function save(Product $product) : void
     {
-        $this->products->set($product->getId()->value(), $product);
+        
     }
     /**
      * @throws AssertionFailedException

79) src/Infrastructure/Persistence/InMemory/InMemoryProductRepository.php:49    [M] Multiplication

--- Original
+++ New
@@ @@
         Assertion::greaterOrEqualThan($numPage, 1, 'Page must be greater or equal than 1');
         Assertion::greaterOrEqualThan($limit, 1, 'Limit must be greater or equal than 1');
         $results = $this->products;
-        $criteria = Criteria::create()->setFirstResult(($numPage - 1) * $limit)->setMaxResults($limit);
+        $criteria = Criteria::create()->setFirstResult(($numPage - 1) / $limit)->setMaxResults($limit);
         if ($isFeatured !== null) {
             $results = $this->products->filter(static fn(Product $product) => $product->getFeatured() === $isFeatured);
         }

80) src/Infrastructure/Persistence/InMemory/InMemoryProductRepository.php:49    [M] Minus

--- Original
+++ New
@@ @@
         Assertion::greaterOrEqualThan($numPage, 1, 'Page must be greater or equal than 1');
         Assertion::greaterOrEqualThan($limit, 1, 'Limit must be greater or equal than 1');
         $results = $this->products;
-        $criteria = Criteria::create()->setFirstResult(($numPage - 1) * $limit)->setMaxResults($limit);
+        $criteria = Criteria::create()->setFirstResult(($numPage + 1) * $limit)->setMaxResults($limit);
         if ($isFeatured !== null) {
             $results = $this->products->filter(static fn(Product $product) => $product->getFeatured() === $isFeatured);
         }

81) src/Infrastructure/Persistence/InMemory/InMemoryProductRepository.php:49    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         Assertion::greaterOrEqualThan($numPage, 1, 'Page must be greater or equal than 1');
         Assertion::greaterOrEqualThan($limit, 1, 'Limit must be greater or equal than 1');
         $results = $this->products;
-        $criteria = Criteria::create()->setFirstResult(($numPage - 1) * $limit)->setMaxResults($limit);
+        $criteria = Criteria::create()->setFirstResult(($numPage - 0) * $limit)->setMaxResults($limit);
         if ($isFeatured !== null) {
             $results = $this->products->filter(static fn(Product $product) => $product->getFeatured() === $isFeatured);
         }

82) src/Infrastructure/Persistence/InMemory/InMemoryProductRepository.php:49    [M] IncrementInteger

--- Original
+++ New
@@ @@
         Assertion::greaterOrEqualThan($numPage, 1, 'Page must be greater or equal than 1');
         Assertion::greaterOrEqualThan($limit, 1, 'Limit must be greater or equal than 1');
         $results = $this->products;
-        $criteria = Criteria::create()->setFirstResult(($numPage - 1) * $limit)->setMaxResults($limit);
+        $criteria = Criteria::create()->setFirstResult(($numPage - 2) * $limit)->setMaxResults($limit);
         if ($isFeatured !== null) {
             $results = $this->products->filter(static fn(Product $product) => $product->getFeatured() === $isFeatured);
         }

83) src/Infrastructure/Persistence/InMemory/InMemoryProductRepository.php:53    [M] NotIdentical

--- Original
+++ New
@@ @@
         Assertion::greaterOrEqualThan($limit, 1, 'Limit must be greater or equal than 1');
         $results = $this->products;
         $criteria = Criteria::create()->setFirstResult(($numPage - 1) * $limit)->setMaxResults($limit);
-        if ($isFeatured !== null) {
+        if ($isFeatured === null) {
             $results = $this->products->filter(static fn(Product $product) => $product->getFeatured() === $isFeatured);
         }
         return $results->matching($criteria)->toArray();

84) src/Infrastructure/Persistence/InMemory/InMemoryProductRepository.php:55    [M] Identical

--- Original
+++ New
@@ @@
         $results = $this->products;
         $criteria = Criteria::create()->setFirstResult(($numPage - 1) * $limit)->setMaxResults($limit);
         if ($isFeatured !== null) {
-            $results = $this->products->filter(static fn(Product $product) => $product->getFeatured() === $isFeatured);
+            $results = $this->products->filter(static fn(Product $product) => $product->getFeatured() !== $isFeatured);
         }
         return $results->matching($criteria)->toArray();
     }

85) src/Infrastructure/Persistence/InMemory/InMemoryProductRepository.php:67    [M] NotIdentical

--- Original
+++ New
@@ @@
     {
         $results = $this->products;
         $criteria = Criteria::create();
-        if ($isFeatured !== null) {
+        if ($isFeatured === null) {
             $results = $this->products->filter(static fn(Product $product) => $product->getFeatured() === $isFeatured);
         }
         return $results->matching($criteria)->count();
